In [1]:
import numpy as np
import pandas as pd

### DataFrame Basic Operations

In [26]:
df = pd.DataFrame({

    'A' : [1,2,3,4,5],
    'B' : [10,20,30,40,50],
    'C' : [100, 200, 300, 400, 500]
})

In [7]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [8]:
df.shape

(5, 3)

In [9]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [11]:
df.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [12]:
df['A'] + 10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

### DataFrame Applying Functions

In [13]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [17]:
def square(n):
    return n **2

In [27]:
df['B'] = df['B'].apply(square)

In [28]:
df

   A     B    C
0  1   100  100
1  2   400  200
2  3   900  300
3  4  1600  400
4  5  2500  500

In [29]:
df['D'] = df['B'].apply(square)
df

   A     B    C        D
0  1   100  100    10000
1  2   400  200   160000
2  3   900  300   810000
3  4  1600  400  2560000
4  5  2500  500  6250000

In [31]:
df['E'] = df['A'].apply(lambda x : x**2)  #Using Lambda expression
df

   A     B    C        D   E
0  1   100  100    10000   1
1  2   400  200   160000   4
2  3   900  300   810000   9
3  4  1600  400  2560000  16
4  5  2500  500  6250000  25